/**************************************************************************************************
 * 作    者：pcitc     创始时间：2017-9-25
 * 修 改 人：                     修改时间：
 * 描    述： 枚举类,项目中前台用到的所有枚举都在此处维护
 **************************************************************************************************/

/*=========================================公用枚举=================================================*/
/**
 * 是否启用(-1全部、0否、1是)
 */
var InUseEnum = {
    //0 否
    No: 0,
    //1 是
    Yes: 1
};

/**
 * 页面模式枚举(1新增,2编辑,3查看)
 */
var PageModelEnum = {
    //1 新增
    NewAdd: 1,
    //2 编辑
    Edit: 2,
    //3 查看
    View: 3,
    //4 删除
    Delete:4,
    //5 详情
    Details: 5
};
/**
 * @type {{Refresh: 1(刷新), Reload: 2(重新加载),NO:(不执行操作)}}
 */
var PageLoadMode = {
    //1 刷新
    Refresh: 1,
    //2 重新加载(从第一页开始加载)
    Reload: 2,
    //3 不执行操作
    None: 3
};

